# 1. ამოცანა
# შექმენი კლასი BankAccount, რომელსაც ექნება: დახურული ატრიბუტები: __balance, __owner.
# მეთოდი deposit(amount) – თანხის დამატება. მეთოდი withdraw(amount) – თანხის გამოტანა (არ უნდა გადავიდეს მინუსში).
# მეთოდი get_balance() – მხოლოდ წაკითხვისთვის. დაწერე კოდი ისე, რომ მომხმარებელს პირდაპირ __balance-ზე წვდომა არ ჰქონდეს.





# 2. ამოცანა
# შექმენი კლასი ShoppingCart, რომელსაც ექნება: ატრიბუტი items (სიაში პროდუქტების რაოდენობა).
# __len__() დააბრუნებს პროდუქტების რაოდენობას. __eq__() ორი კალათის შედარება – აბრუნებს True, თუ რაოდენობა ტოლია.
# გააკეთე 2 კალათა და შეადარე. გააკეთე 3 კალათა და შეადარე. გააკეთე 4 კალათა და შეადარე.





# 3. ამოცანა
# გამოიყენე @dataclass მოდული კლასის Book შესაქმნელად: ველები: title, author, year.
# დაამატე მეთოდი is_classic() → აბრუნებს True, თუ წელი < 1970. შექმენი რამდენიმე წიგნი და შეამოწმე ფუნქცია.





# 4. ამოცანა
# შექმენი კლასი Person, რომელსაც ექნება __del__() მეთოდი, რომელიც ბეჭდავს "Person removed" როცა ობიექტი წაიშლება.
# შექმენი ობიექტი, შემდეგ წაშალე del-ით და ნახე როგორ რეაგირებს garbage collector.





# 5. ამოცანა
# შექმენი კლასი Temperature, რომელსაც ექნება: დახურული ატრიბუტი __celsius. get და set property °C-სთვის. fahrenheit
# property (read-only), რომელიც აბრუნებს °F. შექმენი ობიექტი, შეცვალე °C და შეამოწმე °F ავტომატურად იცვლება თუ არა.





# 6. ამოცანა
# შექმენი კლასი CustomList, რომელიც: ინახავს ელემენტებს. __getitem__() – აბრუნებს ელემენტს ინდექსით.
# __setitem__() – ცვლის ელემენტს. __iter__() – Iterable უნდა იყოს. გამოიყენე for ციკლში შენი CustomList.





# 7. ამოცანა
# შექმენი კლასი Refrigerator, რომელსაც ექნება: ატრიბუტი items (სია).
# __contains__() – აბრუნებს True, თუ პროდუქტი მაცივარშია ("milk" in fridge). __str__() – "Fridge with N items".
# __del__() – "Fridge unplugged!". დაამატე პროდუქტები, შეამოწმე "milk" in fridge, დაბეჭდე ობიექტი და ბოლოს წაშალე.





# 8. ამოცანა
# შექმენი კლასი FunnyCalculator, რომელსაც ექნება:
# __add__() – აბრუნებს "Why are you adding numbers? Just buy a calculator".
# __mul__() – აბრუნებს "Multiplication is too mainstream...".
# __truediv__() – თუ გაყოფ 0-ზე, ბეჭდავს "ZeroDivisionError? Nah, let’s just say infinity"
# __str__() – "I’m the funniest calculator in Python!". ცადე calc + 5, calc * 2, 10 / calc და ნახე რა მოხდება.


